IDEA StatiCa Open Model
NumberGroups Methods
Compatible with IDEA StatiCa Beta 21.0 - beta
Methods
Name | Description
Create(IEnumerable<Double>)
 Creates new instance with one group with specified sequence of numbers.
Create(Double)
 Creates new instance with one group with one value.
Create(Double[])
 Creates new instance with one group with specified sequence of numbers.
Create(String[])
 Creates new instance with varibale count of bolts based on * operator
Create(List<ValueCount>)
 Creates new instance with list of ValueCount .
Create(Double, Int32)
 Creates a new instance of one group with several values (defined by count).
CreateGroups(IEnumerable<Double>)
 Creates new instance with groups with with one value in group.
CreateGroups(Double[])
 Creates new instance with groups with with one value in group.
Top
See Also
Reference
NumberGroups Class
IdeaRS.OpenModel.Parameters Namespace